xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
    cn_cbor_map_put( cb_file1, cn_cbor_string_create( "R", &err ),
                     cn_cbor_string_create( "-1", &err ), &err );

    cn_cbor_array_append( a, cb_file1, &err );
    cn_cbor_map_put( cb_map, cn_cbor_string_create( "list", &err ), a, &err );

    unsigned char encoded[128];
    const ssize_t enc_sz = cn_cbor_encoder_write( encoded, 0, sizeof( encoded ), cb_map );
    cn_cbor_free( cb_map CBOR_CONTEXT_PARAM );

    if ( 0 >= enc_sz )
    {
        xi_set_sft_error( sft_cbor_encoding_error );
        xi_publish_device_log_format_int( in_context_handle, "FILE_INFO Encoding Error",
                                          "encoding FILE_INFO cbor error: %d", enc_sz,
                                          sft_cbor_encoding_error );
        return;
    }

    /* publish the FILE_INFO message */
    xi_publish_data( in_context_handle, xi_stopic, encoded, enc_sz,
                     XI_MQTT_QOS_AT_MOST_ONCE, XI_MQTT_RETAIN_FALSE, NULL, NULL );
    printf( "Published FILE_INFO to %s\n", xi_stopic );
}


void xi_parse_file_update_available( xi_context_handle_t in_context_handle, cn_cbor* cb )
{
    cn_cbor* cb_list;
    cn_cbor* cb_item;
    cn_cbor* cb_file;
    int filelistlength = 0;
    int index;

    /* Zero out download_ctx */
    memset( &download_ctx, 0, sizeof( file_download_ctx_t ) );

    /* Initialize sha256 digest of the file and tracking variables */
    sha256_init( &download_ctx.sha256_context );

    /* check message version */
    cb_item = cn_cbor_mapget_string( cb, "msgver" );
    if ( cb_item )
    {
        if ( 1 != cb_item->v.uint )
        {
            xi_set_sft_error( sft_unsupported_protocol_version );
            xi_publish_device_log_format_int(
                in_context_handle, "File update available error",
                "FILE_UPDATE_AVAILABLE SFT message version: %d is unsupported",
                cb_item->v.uint, sft_unsupported_protocol_version );
            printf( "ERROR: Unsupported FILE_UPDATE_AVIALABLE message version: %d\n",
                    cb_item->v.uint );
            return;
        }
    }

    /* Get the File List.  For this demo it should be only one file */
    cb_list = cn_cbor_mapget_string( cb, "list" );
    if ( cb_list )
    {
        filelistlength = cb_list->length;
    }

    /* iterate over the file list */
    for ( index = 0; index < filelistlength; index++ )
    {
        cb_item = cn_cbor_index( cb_list, index );

        if ( cb_item )
        {
            /* File 'N'ame */
            cb_file = cn_cbor_mapget_string( cb_item, "N" );
            if ( cb_file )
            {
                if ( strlen( firmware_filename ) != cb_file->length ||
                     strncmp( firmware_filename, cb_file->v.str, cb_file->length ) != 0 )
                {
                    xi_set_sft_error( sft_unexpected_filename_error );
                    xi_publish_device_log( in_context_handle, "Unexpected Filename Error",
                                           "Unexpected filename, expected 'firmware'",
                                           sft_unexpected_filename_error );
                    printf( "ERROR: incoming file update has an unexpected name. "
                            "Expected `firmware`" );
                    return;
                }
            }
            else
            {
                xi_missing_cbor_field_error( in_context_handle, "FILE_UPDATE_AVIALABLE",
                                             "N" );
                return;
            }

            /* File 'R'evision */
            cb_file = cn_cbor_mapget_string( cb_item, "R" );
            if ( cb_file )
            {
                strncpy( download_ctx.file_revision, cb_file->v.str,
                         sizeof( download_ctx.file_revision ) );

                if ( ( unsigned int )cb_file->length <
                     sizeof( download_ctx.file_revision ) )
                {
                    download_ctx.file_revision[cb_file->length] = '\0';
                }

                download_ctx.file_revision[sizeof( download_ctx.file_revision ) - 1] =
                    '\0';
            }
            else
            {
                xi_missing_cbor_field_error( in_context_handle, "FILE_UPDATE_AVIALABLE",
                                             "R" );
                return;
            }

            /* File 'S'ize */
            cb_file = cn_cbor_mapget_string( cb_item, "S" );
            if ( cb_file )
            {
                printf( "FILE_UPDATE_AVAILABLE: file length = %d\n", cb_file->v.sint );
                download_ctx.file_length = cb_file->v.sint;

                /* initialize progress tracking */
                tenpercent        = download_ctx.file_length / 10;
                currenttenpercent = tenpercent;
            }
            else
            {
                xi_missing_cbor_field_error( in_context_handle, "FILE_UPDATE_AVIALABLE",
                                             "S" );
                return;
            }

            /* File 'F'ingerprint */
            cb_file = cn_cbor_mapget_string( cb_item, "F" );
            if ( cb_file )
            {
                if ( sizeof( download_ctx.file_sft_fingerprint_str ) - 1 <
                     cb_file->length )
                {
                    xi_set_sft_error( sft_fingerprint_too_large_error );
                    xi_publish_device_log(
                        in_context_handle, "File update available error",
                        "Fingerprint size too large.", sft_fingerprint_too_large_error );
                    printf( "ERROR: incoming fingerprint to large for local storage "
                            "buffer." );
                }
                else
                {
                    memset( download_ctx.file_sft_fingerprint_str, '\0',
                            sizeof( download_ctx.file_sft_fingerprint_str ) );
                    strncpy( download_ctx.file_sft_fingerprint_str, cb_file->v.str,
                             cb_file->length );
                }
            }
            else
            {
                xi_missing_cbor_field_error( in_context_handle, "FILE_UPDATE_AVIALABLE",
                                             "F" );
                return;
            }
        }
        else
        {
            xi_missing_cbor_field_error( in_context_handle, "FILE_UPDATE_AVIALABLE",
                                         "list" );
            return;
        }
    }

    /* Log the FILE_UPDATE_AVAILABLE information */
    {
        char log_details_str[LOGDETAILSSIZE];
        snprintf( log_details_str, sizeof( log_details_str ),
                  "name=%s revision=%s length = %d", firmware_filename,
                  download_ctx.file_revision, download_ctx.file_length );
        xi_publish_device_log( in_context_handle, "File update available",
                               log_details_str, sft_status_ok );
    }

    /* Set Download State to Active */
    download_ctx.is_downloading = 1;

