xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
    /* Send the Chunk Request */
    xi_publish_file_chunk_request( in_context_handle, firmware_filename,
                                   download_ctx.file_revision,
                                   download_ctx.file_storage_offset );
}

/*
 * Formats a FILE_GET_CHUNK cbor message with the provided parameters and then publishes
 * the message to the SFT Service.
 *
 * Returns 0 on success, or -1 if the message could not be queued for publication
 * (probably due to a too-small encoding buffer)
 */
void xi_publish_file_chunk_request( xi_context_handle_t in_context_handle,
                                    const char* file_name,
                                    const char* file_revision,
                                    int offset )
{
    const int message_type    = XI_FILE_GET_CHUNK;
    const int message_version = 1;
    const int chunk_length    = 1024;

#if 0
    printf( "XI_FILE_GET_CHUNK request params: " );
    printf( "N: \"%s\", ", file_name );
    printf( "R: \"%s\", ", file_revision );
    printf( "O: %d, ", offset );
    printf( "L: %d\n", chunk_length );
#endif

    /* Format a CBOR message of the FILE_GET_CHUNK message type. */
    cn_cbor_errback err;
    cn_cbor* cb_map = cn_cbor_map_create( &err );

    cn_cbor_map_put( cb_map, cn_cbor_string_create( "msgtype", &err ),
                     cn_cbor_int_create( message_type, &err ), &err );

    cn_cbor_map_put( cb_map, cn_cbor_string_create( "msgver", &err ),
                     cn_cbor_int_create( message_version, &err ), &err );

    cn_cbor_map_put( cb_map, cn_cbor_string_create( "N", &err ),
                     cn_cbor_string_create( file_name, &err ), &err );

    cn_cbor_map_put( cb_map, cn_cbor_string_create( "R", &err ),
                     cn_cbor_string_create( file_revision, &err ), &err );

    cn_cbor_map_put( cb_map, cn_cbor_string_create( "O", &err ),
                     cn_cbor_int_create( offset, &err ), &err );

    cn_cbor_map_put( cb_map, cn_cbor_string_create( "L", &err ),
                     cn_cbor_int_create( chunk_length, &err ), &err );

    unsigned char encoded[128];
    const ssize_t enc_sz = cn_cbor_encoder_write( encoded, 0, sizeof( encoded ), cb_map );
    cn_cbor_free( cb_map CBOR_CONTEXT_PARAM );

    if ( 0 >= enc_sz )
    {
        xi_set_sft_error( sft_cbor_encoding_error );
        xi_publish_device_log_format_int(
            in_context_handle, "FILE_GET_CHUNK Encoding Error",
            "encoding FILE_GET_CHUNK cbor error: %d", enc_sz, sft_cbor_encoding_error );
        return;
    }

    xi_state_t xi_state =
        xi_publish_data( in_context_handle, xi_stopic, encoded, enc_sz,
                         XI_MQTT_QOS_AT_MOST_ONCE, XI_MQTT_RETAIN_FALSE, NULL, NULL );
    if ( XI_STATE_OK != xi_state )
    {
        xi_set_sft_error( sft_publish_error );
        xi_publish_device_log_format_int( in_context_handle, "Publish Error",
                                          "Error publishing GET_FILE_CHUNK request. "
                                          "xi_status code from xively client: %d",
                                          xi_state, sft_publish_error );
    }
}

/* @brief Processes incoming SFT FILE_CHUNK messages, storing the data.
 *
 * Process the cbor object as a FILE_CHUNK message, calling xi_parse_file_chunk to extract
 * the
 * cbor fields and then act upon them to store the data into the flash file system's
 * firmware image file.  If there is more of the file to be downloaded then a subsequent
 * GET_CHUNK request is encoded and published to the SFT service.
 */
void xi_process_file_chunk( xi_context_handle_t in_context_handle, cn_cbor* cb )
{
    xi_sft_file_chunk_t file_chunk_data;
    xi_parse_file_chunk( in_context_handle, cb, &file_chunk_data );
    if ( sft_status_ok != download_ctx.result )
    {
        return;
    }

    /* Ensure that this chunk starts where we left off. */
    if ( download_ctx.file_storage_offset != file_chunk_data.offset )
    {
        printf( "ERROR: unexpected Chunk Offset Delivered by SFT!\n" );
        xi_set_sft_error( sft_file_data_offset_error );
        xi_publish_device_log_format_int_int(
            in_context_handle, "File Chunk Offset Error",
            "Expected offset: %d but recieved offset: %d",
            download_ctx.file_storage_offset, file_chunk_data.offset,
            sft_file_data_offset_error );
        return;
    }

    /* Track Progress */
    if ( currenttenpercent < file_chunk_data.offset )
    {
        printf( "Downloaded %d bytes %d %%  of the file \n",
                download_ctx.file_storage_offset,
                ( 100 * ( currenttenpercent + 1000 ) ) / download_ctx.file_length );
        currenttenpercent += tenpercent;
    }

    /* Ensure that we have a buffer to write from */
    if ( 0 == file_chunk_data.array_length )
    {
        printf( "ERROR: FILE_CHUNK cbor message has zero length byte array\n" );
        xi_set_sft_error( sft_empty_length_array_error );
        xi_publish_device_log(
            in_context_handle, "File Chunk Data Error",
            "FILE_CHUNK message from SFT has a zero length data array.",
            sft_empty_length_array_error );
        return;
    }

    /* convert from unsigned to signed becuase TI's API has a signed length variable */
    if ( file_chunk_data.offset + file_chunk_data.array_length >
         download_ctx.file_length )
    {
        printf( "ERROR: Chunk offset + length extends beyond length of file\n" );
        xi_set_sft_error( sft_file_data_offset_error );
        xi_publish_device_log_format_int_int(
            in_context_handle, "File Chunk Offset Error",
            "Offset: %d length: %d goes beyond bounds of file length.",
            file_chunk_data.offset + file_chunk_data.array_length,
            download_ctx.file_length, sft_file_data_offset_error );
        return;
    }

    int write_length = ( int )file_chunk_data.array_length;
    if ( 0 == write_length )
    {
        printf( "ERROR: FILE_CHUNK zero length data array\n" );
        xi_set_sft_error( sft_empty_length_array_error );
        xi_publish_device_log( in_context_handle, "File Chunk Write Error",
                               "Casting file chunk array length is zero",
                               sft_empty_length_array_error );
        return;
    }

    if ( 0 > write_length )
    {
        /* Negative values means that we lost data in the unsigned -> signed conversion.
         */
        printf( "ERROR: WriteBuffer is too large for CC3200 sl_extlib_FlcWriteFile "
                "operations\n" );
        xi_set_sft_error( sft_write_error );
        xi_publish_device_log(
            in_context_handle, "File Chunk Write Error",
            "WriteBuffer is too large for CC3200 sl_extlib_FlcWriteFile operations",
            sft_write_error );
        return;
    }

    int bytes_written = sl_extlib_FlcWriteFile(
        download_ctx.file_handle, file_chunk_data.offset,
        ( unsigned char* )file_chunk_data.byte_array, write_length );
    if ( 0 >= bytes_written )
    {
        printf( "ERROR: sl_extlib_FlcWriteFile returned error code: %d\n",
                bytes_written );
        xi_set_sft_error( sft_write_error );
        xi_publish_device_log_format_int(
            in_context_handle, "File Write Error",
            "l_extlib_FlcWriteFile returned error code: %d.", bytes_written,
            sft_write_error );
        return;
    }
    else
    {
        /* update the SHA256 digest with the provided data */
        sha256_update( &download_ctx.sha256_context,
                       ( unsigned char* )file_chunk_data.byte_array, bytes_written );

