xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
        /* Track our progress through the file */
        download_ctx.file_storage_offset = file_chunk_data.offset + bytes_written;

        /* Check for completeness */
        if ( download_ctx.file_storage_offset >= download_ctx.file_length )
        {
            /* Download Complete */
            download_ctx.is_downloading = 0;
        }
    }

    if ( 1 < file_chunk_data.status )
    {
        printf( "ERROR: SFT packet reported Chunk Status Request Error: %d\n",
                file_chunk_data.status );
        xi_set_sft_error( sft_cbor_error_field_set_error );
        xi_publish_device_log_format_int(
            in_context_handle, "File Chunk Status Error",
            "FILE_CHUNK status CBOR field contains an error status: %d",
            file_chunk_data.status, sft_cbor_error_field_set_error );
    }

    if ( download_ctx.is_downloading )
    {
        /* If still download  continuing, create another FILE_CHUNK request to the SFT
         * service */
        xi_publish_file_chunk_request( in_context_handle, firmware_filename,
                                       download_ctx.file_revision,
                                       download_ctx.file_storage_offset );
    }
}

/* @brief Parses a FILE_CHUNK cbor message into a given data structure.
 *
 * Parses the CBOR message to get the FILE_CHUNK required FILE_CHUNK fields
 * and places the data in the out_sft_file_chunk structure
 * Returns 0 on success, or -1 if there are missing fields or null parameters
 */
void xi_parse_file_chunk( xi_context_handle_t in_context_handle,
                          cn_cbor* in_cb,
                          xi_sft_file_chunk_t* out_sft_file_chunk )
{
    if ( NULL == in_cb || NULL == out_sft_file_chunk )
    {
        xi_set_sft_error( sft_internal_error );
        xi_publish_device_log( in_context_handle, "Internal Error",
                               "xi_parse_file_chunk null pointer parameter",
                               sft_internal_error );
    }

    /* use the RED LED to signal downloading progress */
    static int ledToggle = 0;
    ledToggle            = ( ledToggle + 1 ) % 2;
    if ( ledToggle )
    {
        GPIO_IF_LedOn( MCU_RED_LED_GPIO );
    }
    else
    {
        GPIO_IF_LedOff( MCU_RED_LED_GPIO );
    }

    cn_cbor* cb_item = NULL;
    memset( out_sft_file_chunk, 0, sizeof( xi_sft_file_chunk_t ) );

    /* msg version */
    cb_item = cn_cbor_mapget_string( in_cb, "msgver" );
    if ( cb_item )
    {
        if ( 1 != cb_item->v.uint )
        {
            printf( "ERROR: Unsupported FILE_CHUNK message version: %d\n",
                    cb_item->v.uint );
            xi_set_sft_error( sft_unsupported_protocol_version );
            xi_publish_device_log_format_int(
                in_context_handle, "FILE_CHUNK error",
                "FILE_CHUNK Packet version: %d is unsupported", cb_item->v.uint,
                sft_unsupported_protocol_version );
            return;
        }
    }
    else
    {
        xi_missing_cbor_field_error( in_context_handle, "FILE_CHUNK", "msgver" );
        return;
    }

    /* chunk offset */
    cb_item = cn_cbor_mapget_string( in_cb, "O" );
    if ( cb_item )
    {
        out_sft_file_chunk->offset = cb_item->v.uint;
    }
    else
    {
        xi_missing_cbor_field_error( in_context_handle, "FILE_CHUNK", "O" );
        return;
    }

    /* chunk length */
    cb_item = cn_cbor_mapget_string( in_cb, "L" );
    if ( cb_item )
    {
        out_sft_file_chunk->chunk_length = cb_item->v.uint;
    }
    else
    {
        xi_missing_cbor_field_error( in_context_handle, "FILE_CHUNK", "L" );
        return;
    }

    /* Status */
    cb_item = cn_cbor_mapget_string( in_cb, "S" );
    if ( cb_item )
    {
        out_sft_file_chunk->status = cb_item->v.uint;
    }
    else
    {
        xi_missing_cbor_field_error( in_context_handle, "FILE_CHUNK", "S" );
        return;
    }

    /* Byte Array */
    cb_item = cn_cbor_mapget_string( in_cb, "C" );
    if ( cb_item )
    {
        out_sft_file_chunk->array_length = cb_item->length;
        out_sft_file_chunk->byte_array   = ( unsigned char* )cb_item->v.str;
    }
    else
    {
        xi_missing_cbor_field_error( in_context_handle, "FILE_CHUNK", "C" );
        return;
    }
}


/* @brief verify that the fingerprint matches the download file.
 *
 * Invoked when file download is complete.
 * Converts the locally computed hash into a string
 * and compares it to the SFT hash string 'fingerprint'
 * that we received during the FILE_UPDATE_AVAILABLE message.
 * Reports an error to Device Logs if there's a mis match,
 * and marks the error state.
 */
void verify_sha256( xi_context_handle_t in_context_handle )
{
    /* Finalize SHA256 Digest */
    sha256_final( &download_ctx.sha256_context,
                  download_ctx.file_local_computed_fingerprint );
    printf( "Calculated hash = 0x" );
    print_hash( download_ctx.file_local_computed_fingerprint );

    char local_fingerprint_str[65];
    char* buff_ptr = local_fingerprint_str;

    /* convert binary to a string matching SFT fingprint format */
    int i;
    for ( i = 0; i < 32; ++i )
    {
        buff_ptr +=
            sprintf( buff_ptr, "%02x", download_ctx.file_local_computed_fingerprint[i] );
    }

    /* null terminate the string */
    *buff_ptr = '\0';

    /* are they the same? If not then raise the red flag */
    if ( 0 !=
         strncmp( local_fingerprint_str, download_ctx.file_sft_fingerprint_str, 64 ) )
    {
        printf( "File Update Fingerprint mismatch.  SFT Fingerprint: %s  "
                "device-calculated fingerprint: %s\n",
                download_ctx.file_sft_fingerprint_str, local_fingerprint_str );
        xi_set_sft_error( sft_fingerprint_mismatch_error );
        xi_publish_device_log_format_str_str(
            in_context_handle, "File Update Fingerprint Mismatch",
            "sft fingerprint: %s device-calculated fingerprint: %s ",
            download_ctx.file_sft_fingerprint_str, local_fingerprint_str,
            sft_fingerprint_mismatch_error );
        return;
    }
}

