xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
/*
 * Error Handling functions
 */

/* @brief note an error in the download process
 *
 * This is a utility function for marking that the download has finished
 * so that the downloading state machine can recognize the error.  An
 * error code is set so that the error can later be identified and sent
 * to the Device Logs service.
 */
void xi_set_sft_error( sft_status_t status )
{
    download_ctx.is_downloading = 0;
    download_ctx.result         = status;
}

/*@brief tracks the case where a cbor field was missing, and sets the corresponding error.
 *
 * Invoke if a cbor encoded message is missing a required parameter.
 * This will set the error state of the download context, report the error
 * to serial, and report it to the Device Logs service.
 */
void xi_missing_cbor_field_error( xi_context_handle_t in_context_handle,
                                  const char* cbor_message_name,
                                  const char* field_name )
{
    xi_set_sft_error( sft_cbor_missing_field_error );

    if ( NULL == cbor_message_name || NULL == field_name )
    {
        printf( "ERROR: invalid parameter passed to missing_cbor_field_error\n" );
        return;
    }

    printf( "ERROR: SFT Message: %s missing CBOR field: %s\n", cbor_message_name,
            field_name );

    /* Send to Device Logs */
    char log_details_str[LOGDETAILSSIZE];
    snprintf( log_details_str, sizeof( log_details_str ),
              "SFT Message: %s missing CBOR field: %s", cbor_message_name, field_name );

    xi_publish_device_log( in_context_handle, "File update available error",
                           log_details_str, sft_cbor_missing_field_error );
}


/*
 * Device Log Functions
 *
 * Note: Device log entires appear in the 'Logs' tab in Xively CPM's Device Details page
 * of your
 * particular Xively provisioned device.
 *
 */

/* @brief creates an entry in the device log server, whether good or bad. */
void xi_publish_device_log( xi_context_handle_t in_context_handle,
                            const char* message_str,
                            const char* details_str,
                            const sft_status_t status )
{
    /* Formats a message in the correct Xively Device Logs format and publishes it
     * to the device logs topic. Note that, due to the asynchronous behavior
     * of the client for the platform, this requires a few Xively ticks before
     * sending, so don't reboot immediately following a logged error! */

    if ( NULL == message_str || NULL == details_str )
    {
        printf(
            "\nWarning: xi_publish_device_log invoked with a null string parameter\n" );
        return;
    }
    else if ( sft_status_max <= status )
    {
        printf( "\nWarning: xi_publish_device_log invoked with an invalid status "
                "parametern" );
        return;
    }

    char* severity_str = "";
    switch ( status )
    {
        case sft_status_rebooting:
            severity_str = "alert";
            break;
        case sft_status_ok:
            severity_str = "notice";
            break;
        default:
            severity_str = "error";
            break;
    }

    char device_log_buffer[400];
    snprintf(
        device_log_buffer, sizeof( device_log_buffer ),
        "{\"message\":\"%s\",\"severity\":\"%s\",\"code\":\"%d\",\"details\":\"%s: %s\"}",
        message_str, severity_str, status, sft_status_strings[status], details_str );
    printf( "publishing log: %s\n", device_log_buffer );
    xi_publish( in_context_handle, xi_logtopic, device_log_buffer,
                XI_MQTT_QOS_AT_MOST_ONCE, XI_MQTT_RETAIN_FALSE, NULL, NULL );
}

/* @brief utility function that formats an integer into the device logs message. */
void xi_publish_device_log_format_int( xi_context_handle_t in_context_handle,
                                       const char* message_str,
                                       const char* details_str,
                                       const int value_int,
                                       const sft_status_t status )
{
    char log_details[LOGDETAILSSIZE];
    strncpy( log_details, details_str, LOGDETAILSSIZE );
    snprintf( log_details, LOGDETAILSSIZE, details_str, value_int );
    xi_publish_device_log( in_context_handle, message_str, log_details, status );
}

/* @brief utility function that formats two integers into the device logs message. */
void xi_publish_device_log_format_int_int( xi_context_handle_t in_context_handle,
                                           const char* message_str,
                                           const char* details_str,
                                           const int value_int1,
                                           const int value_int2,
                                           const sft_status_t status )
{
    char log_details[LOGDETAILSSIZE];
    strncpy( log_details, details_str, LOGDETAILSSIZE );
    snprintf( log_details, LOGDETAILSSIZE, details_str, value_int1, value_int2 );
    xi_publish_device_log( in_context_handle, message_str, log_details, status );
}

/* @brief utility function that formats a string into the device logs message. */
void xi_publish_device_log_format_str( xi_context_handle_t in_context_handle,
                                       const char* message_str,
                                       const char* details_str,
                                       const char* value_str,
                                       const sft_status_t status )
{
    char log_details[LOGDETAILSSIZE];
    strncpy( log_details, details_str, LOGDETAILSSIZE );
    snprintf( log_details, LOGDETAILSSIZE, details_str, value_str );
    xi_publish_device_log( in_context_handle, message_str, log_details, status );
}

/* @brief utility function that formats two strings into the device logs message. */
void xi_publish_device_log_format_str_str( xi_context_handle_t in_context_handle,
                                           const char* message_str,
                                           const char* details_str,
                                           const char* value_str1,
                                           const char* value_str2,
                                           const sft_status_t status )

{
    char log_details[LOGDETAILSSIZE];
    strncpy( log_details, details_str, LOGDETAILSSIZE );
    snprintf( log_details, LOGDETAILSSIZE, details_str, value_str1, value_str2 );
    xi_publish_device_log( in_context_handle, message_str, log_details, status );
}

/* Functions useful for debugging */
void print_hash( unsigned char hash[] )
{
    int idx;
    for ( idx = 0; idx < 32; idx++ )
    {
        printf( "%02x", hash[idx] );
    }
    printf( "\n" );
}

#ifdef XI_DEBUGSFT
void dump( const cn_cbor* cb, char* out, char** end, int indent )
{
    int i;
    cn_cbor* cp;
    char finchar = ')'; /* most likely */

#define CPY( s, l )                                                                      \
    memcpy( out, s, l );                                                                 \
    out += l;
#define OUT( s ) CPY( s, sizeof( s ) - 1 )
#define PRF( f, a ) out += sprintf( out, f, a )

