xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
    if ( !cb )
        goto done;

    for ( i = 0; i < indent; i++ )
        *out++ = ' ';
    switch ( cb->type )
    {
        case CN_CBOR_TEXT_CHUNKED:
            OUT( "(_\n" );
            goto sequence;
        case CN_CBOR_BYTES_CHUNKED:
            OUT( "(_\n\n" );
            goto sequence;
        case CN_CBOR_TAG:
            PRF( "%ld(\n", cb->v.sint );
            goto sequence;
        case CN_CBOR_ARRAY:
            finchar = ']';
            OUT( "[\n" );
            goto sequence;
        case CN_CBOR_MAP:
            finchar = '}';
            OUT( "{\n" );
            goto sequence;
        sequence:
            for ( cp = cb->first_child; cp; cp = cp->next )
            {
                dump( cp, out, &out, indent + 2 );
            }
            for ( i = 0; i < indent; i++ )
                *out++ = ' ';
            *out++     = finchar;
            break;
        case CN_CBOR_BYTES:
            OUT( "h'\n" );
            for ( i = 0; i < cb->length; i++ )
            {
                PRF( "%02x ", cb->v.str[i] & 0xff );
            }

            *out++ = '\'';
            break;
        case CN_CBOR_TEXT:
            *out++ = '"';
            CPY( cb->v.str, cb->length ); /* should escape stuff */
            *out++ = '"';
            break;
        case CN_CBOR_NULL:
            OUT( "null" );
            break;
        case CN_CBOR_TRUE:
            OUT( "true" );
            break;
        case CN_CBOR_FALSE:
            OUT( "false" );
            break;
        case CN_CBOR_UNDEF:
            OUT( "simple(23)" );
            break;
        case CN_CBOR_INT:
            PRF( "%ld", cb->v.sint );
            break;
        case CN_CBOR_UINT:
            PRF( "%lu", cb->v.uint );
            break;
        case CN_CBOR_DOUBLE:
            PRF( "%e", cb->v.dbl );
            break;
        case CN_CBOR_SIMPLE:
            PRF( "simple(%ld)", cb->v.sint );
            break;
        default:
            PRF( "???%d???", cb->type );
            break;
    }
    *out++ = '\n';
done:
    *end = out;
}
#endif
